{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi", "Hey", "Hello", "Good Morning", "Greetings", "What's up", "Yo", "Hi there"
      ],
      "responses": [
        "Welcome to PathMaster AI. I am your strategic diagnostic center for career alignment. Which professional path shall we analyze today?",
        "Greetings! I am PathMaster. I can help you synchronize your current studies with your true passions. What path are you considering?",
        "Hello! Whether you are looking into Engineering, the Arts, or Medicine, I have the roadmap ready. How can I assist you today?"
      ]
    },
    {
      "tag": "path_engineering",
      "patterns": [
        "I want to be an engineer", "engineering roadmap", "steps to become an engineer", "engineering career", "how to start engineering", "engineering path"
      ],
      "responses": [
        "The Engineering path requires a strong foundation in logic and problem-solving. Here is the strategic roadmap:\n\n1. Foundational Phase (High School/Junior College): Focus heavily on Physics, Chemistry, and Advanced Mathematics (Calculus and Linear Algebra).\n2. Entrance & Education: Prepare for relevant entrance exams (like JEE in India or SAT/ACT for US) to secure a seat in a B.Tech or B.E. program.\n3. Specialization: During your second year, choose a niche: Software (Coding), Mechanical (Design/Thermo), Civil (Infrastructure), or Electrical (Power systems).\n4. Technical Skillset: Master industry-standard software like AutoCAD (Civil/Mech), MATLAB (Electrical), or Python/Java (Software).\n5. Professional Certification: Pursue internships and FE/PE certifications for long-term licensing.\n\n"
      ]
    },
    {
      "tag": "path_medicine",
      "patterns": [
        "how to become a doctor", "medical roadmap", "medicine career", "MBBS path", "healthcare professional steps", "becoming a surgeon"
      ],
      "responses": [
        "The Medical path is one of the most rigorous and rewarding. Here is the long-term roadmap:\n\n1. Pre-Medical Phase: High proficiency in Biology and Organic Chemistry is mandatory.\n2. Medical School: Clear entrance exams (like NEET or MCAT) to enter an MBBS or MD program. This usually takes 5-6 years.\n3. Internship/Clerkship: Complete a mandatory rotatory internship to gain hands-on clinical experience across different departments.\n4. Specialization (Residency): After graduation, choose a specialty through further exams (MD/MS) in fields like Cardiology, Pediatrics, or Surgery.\n5. Licensing: Register with the national medical council to practice legally.\n\n"
      ]
    },
    {
      "tag": "path_arts_dance",
      "patterns": [
        "dancing career", "how to be a professional dancer", "arts and dance roadmap", "career in performing arts", "dance profession steps"
      ],
      "responses": [
        "The Performing Arts and Dance path requires a blend of physical mastery and brand management. Here is the roadmap:\n\n1. Early Training: Start with classical or contemporary training at a recognized dance academy to build core strength and flexibility.\n2. Formal Education: Consider a Bachelor of Fine Arts (BFA) in Dance or Performing Arts to learn theory, history, and choreography.\n3. Portfolio Building: Join dance troupes, participate in national level extracurriculars, and document your work for a digital portfolio.\n4. Networking & Auditions: Move to industry hubs and begin auditioning for commercial work, theater, or teaching positions.\n5. Diversification: Many pros pivot into Dance Therapy, Arts Management, or Pilates instruction for career longevity."
      ]
    },
    {
      "tag": "path_management",
      "patterns": [
        "MBA roadmap", "how to become a manager", "business management career", "corporate path", "management consultant steps"
      ],
      "responses": [
        "The Management path focuses on leadership and operational efficiency. Strategic steps include:\n\n1. Undergraduate Degree: While any field works, degrees in Business, Finance, or Economics provide an early edge.\n2. Work Experience: Gain 2-3 years of professional experience to understand corporate hierarchy and operational challenges.\n3. Higher Education (MBA): Clear exams like CAT, GMAT, or GRE to enter a top-tier Business School.\n4. Specialization: Focus on Finance, Marketing, Human Resources, or Operations during your MBA.\n5. Corporate Climb: Start as an Associate or Management Trainee and move toward C-suite (CEO/COO) roles by delivering strategic value."
      ]
    },
    {
      "tag": "alignment_query",
      "patterns": [
        "is my passion right for me", "passion vs studies", "how to align my career", "strategic analysis help", "pathmaster analysis"
      ],
      "responses": [
        "To give you a precise answer, please use the 'Strategic Analysis' form above. By inputting your 'Current Course' and 'Passion', I can calculate your ALIGNMENT SCORE. \n\nIf your score is above 70, you have a high success probability. If it's lower, I will suggest a 'Pivot Strategy' to help you bridge the gap between what you are studying and what you love."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye", "Goodbye", "See you later", "Take care", "thank you", "thanks for the help"
      ],
      "responses": [
        "Farewell! Keep focusing on your metrics. PathMaster is always here to re-align your strategy.",
        "Goodbye. Remember: A career path is a marathon, not a sprint. Best of luck with your roadmap!",
        "By... Wish you a successful journey in your chosen career path!"
      ]
    }
  ]
}
